tutorials/LID/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o., Wed Jan 25 11:27:58 2017               |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    //default        Gauss cubic;
    //grad(p) Gauss linear;
}

divSchemes
{
    default          Gauss linear;
    //default  Gauss cubic;
    /*div(phi,U) Gauss linear;

    div(U) Gauss linear;

    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(Ua))))) Gauss linear;
    div((interpolate(U)&S),U) Gauss linear;
    div((interpolate(U)&S),Usup) Gauss linear;
    div((interpolate(U)&S),Ulift0) Gauss linear;
    div((interpolate(Usup)&S),U) Gauss linear;
    div((interpolate(Usup)&S),Usup) Gauss linear;
    div((interpolate(Usup)&S),Ulift0) Gauss linear;
    div((interpolate(Ulift0)&S),U) Gauss linear;
    div((interpolate(Ulift0)&S),Usup) Gauss linear;
    div((interpolate(Ulift0)&S),Ulift0) Gauss linear;
    div(Ulift0) Gauss linear;*/
    
}

laplacianSchemes
{
    //default        Gauss cubic orthogonal;
    default        Gauss linear orthogonal;
}

interpolationSchemes
{
    //default         cubic;
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
//default         cubic orthogonal;
}

fluxRequired
{
    default         no;
    p;
    Phi;
}



// ************************************************************************* //
